tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "nicoverbruggen/cask"

# Homebrew packages
brew "mas"
brew "ncdu"
brew "node"
brew "tree"
brew "dnsmasq", restart_service: true
brew "mysql@5.7", restart_service: true
brew "nginx", restart_service: true
brew "php", restart_service: true

# Cask-installable apps
cask "anki"
cask "coconutbattery"
cask "discord"
cask "forecast"
cask "latest"
cask "libreoffice"
cask "phpmon"
cask "firefox"
cask "visual-studio-code"
cask "iterm2"
cask "keepassxc"
cask "keka"
cask "imageoptim"
cask "iina"
cask "obs"
cask "macs-fan-control"
cask "alfred"

# Paid apps
cask "scapple"
cask "scrivener"
cask "istat-menus"
cask "reaper"
cask "sublime-merge"
cask "sublime-text"
cask "transmit"
cask "phpstorm"
cask "dropbox"
cask "daisydisk"
cask "bartender"
cask "carbon-copy-cloner"
cask "paw"

## Apple apps
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
mas "Xcode", id: 497799835

## Free
mas "Sequel Ace", id: 1518036000
mas "LittleIpsum", id: 405772121
mas "Amphetamine", id: 937984704

## Paid apps
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Pastebot", id: 1179623856
mas "Ulysses", id: 1225570693
mas "1Blocker", id: 1107421413
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "iA Writer", id: 775737590
mas "Image2icon", id: 992115977
mas "MediaInfo", id: 510620098